Revit 2024 API
SpecTypeId.SectionDimension Property
 Section Dimension, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId SectionDimension { get; }
Visual Basic
Public Shared ReadOnly Property SectionDimension As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SectionDimension {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace